<a href="https://colab.research.google.com/github/BountyHunter1999/Machine-Learning-Zoom-Camp/blob/main/Homeworks/Homework%20%233.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Importing Necessary Modules

In [1]:
import numpy as np
import pandas as pd

import matplotlib.pyplot as plt

from sklearn.model_selection import train_test_split

%matplotlib inline

# Getting The Data and First Glance at it

In [2]:
!wget https://raw.githubusercontent.com/alexeygrigorev/datasets/master/AB_NYC_2019.csv

--2021-09-23 03:38:32--  https://raw.githubusercontent.com/alexeygrigorev/datasets/master/AB_NYC_2019.csv
Resolving raw.githubusercontent.com (raw.githubusercontent.com)... 185.199.108.133, 185.199.109.133, 185.199.110.133, ...
Connecting to raw.githubusercontent.com (raw.githubusercontent.com)|185.199.108.133|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 7077973 (6.8M) [text/plain]
Saving to: ‘AB_NYC_2019.csv.2’

AB_NYC_2019.csv.2   100%[===================>]   6.75M  --.-KB/s    in 0.06s

2021-09-23 03:38:32 (105 MB/s) - ‘AB_NYC_2019.csv.2’ saved [7077973/7077973]

In [3]:
cols = ['neighbourhood_group',
'room_type',
'latitude',
'longitude',
'price',
'minimum_nights',
'number_of_reviews',
'reviews_per_month',
'calculated_host_listings_count',
'availability_365']

In [4]:
pd.read_csv("AB_NYC_2019.csv").shape # we don't need all of these

(48895, 16)

In [5]:
df = pd.read_csv("AB_NYC_2019.csv", usecols=cols) # getting only what we need

In [6]:
df.shape

(48895, 10)

## Looking At The Data

In [7]:
df.head()

  neighbourhood_group  ...  availability_365
0            Brooklyn  ...               365
1           Manhattan  ...               355
2           Manhattan  ...               365
3            Brooklyn  ...               194
4           Manhattan  ...                 0

[5 rows x 10 columns]

In [8]:
df.head().T

                                           0  ...                4
neighbourhood_group                 Brooklyn  ...        Manhattan
latitude                             40.6475  ...          40.7985
longitude                           -73.9724  ...          -73.944
room_type                       Private room  ...  Entire home/apt
price                                    149  ...               80
minimum_nights                             1  ...               10
number_of_reviews                          9  ...                9
reviews_per_month                       0.21  ...              0.1
calculated_host_listings_count             6  ...                1
availability_365                         365  ...                0

[10 rows x 5 columns]

## Checking Null Values

In [9]:
df.isnull().sum()

neighbourhood_group                   0
latitude                              0
longitude                             0
room_type                             0
price                                 0
minimum_nights                        0
number_of_reviews                     0
reviews_per_month                 10052
calculated_host_listings_count        0
availability_365                      0
dtype: int64

In [10]:
df['reviews_per_month'] = df['reviews_per_month'].fillna(0)

In [11]:
df.isnull().sum()

neighbourhood_group               0
latitude                          0
longitude                         0
room_type                         0
price                             0
minimum_nights                    0
number_of_reviews                 0
reviews_per_month                 0
calculated_host_listings_count    0
availability_365                  0
dtype: int64

# DATA PREPARATION

### knowing about the data

In [12]:
df.dtypes

neighbourhood_group                object
latitude                          float64
longitude                         float64
room_type                          object
price                               int64
minimum_nights                      int64
number_of_reviews                   int64
reviews_per_month                 float64
calculated_host_listings_count      int64
availability_365                    int64
dtype: object

In [13]:
df.dtypes == "object"

neighbourhood_group                True
latitude                          False
longitude                         False
room_type                          True
price                             False
minimum_nights                    False
number_of_reviews                 False
reviews_per_month                 False
calculated_host_listings_count    False
availability_365                  False
dtype: bool

In [14]:
df.dtypes[df.dtypes == "object"]

neighbourhood_group    object
room_type              object
dtype: object

In [15]:
df.dtypes[df.dtypes == 'object'].index

Index(['neighbourhood_group', 'room_type'], dtype='object')

In [16]:
categorical_cols = list(df.dtypes[df.dtypes == 'object'].index)
categorical_cols

['neighbourhood_group', 'room_type']

In [17]:
df.columns = df.columns.str.lower()

In [18]:
df[categorical_cols[0]][:4]

0     Brooklyn
1    Manhattan
2    Manhattan
3     Brooklyn
Name: neighbourhood_group, dtype: object

In [19]:
df[categorical_cols[0]][:4].str.lower().str.replace(" ", "_")

0     brooklyn
1    manhattan
2    manhattan
3     brooklyn
Name: neighbourhood_group, dtype: object

In [20]:
for c in categorical_cols:
  df[c] = df[c].str.lower().str.replace(" ", "_")

In [21]:
df.head().T

                                           0  ...                4
neighbourhood_group                 brooklyn  ...        manhattan
latitude                             40.6475  ...          40.7985
longitude                           -73.9724  ...          -73.944
room_type                       private_room  ...  entire_home/apt
price                                    149  ...               80
minimum_nights                             1  ...               10
number_of_reviews                          9  ...                9
reviews_per_month                       0.21  ...              0.1
calculated_host_listings_count             6  ...                1
availability_365                         365  ...                0

[10 rows x 5 columns]

# Question #1

In [22]:
df[categorical_cols].nunique()

neighbourhood_group    5
room_type              3
dtype: int64

In [23]:
df["neighbourhood_group"].value_counts()

manhattan        21661
brooklyn         20104
queens            5666
bronx             1091
staten_island      373
Name: neighbourhood_group, dtype: int64

In [24]:
train_test_split?


1.   First line split the dataset into (train + val) and test dataset 
  - (80%, 20%) with random seed of 42
2.   the second line we split the (train + val) into train and val
  - `.25` is there instead of `0.2` as we are splitting from the 80% of the original data
  - so 20% of 80% is `0.25`

In [25]:
df_full_train, df_test = train_test_split(df, test_size=0.2, random_state=42)
df_train, df_val = train_test_split(df_full_train, test_size=0.25, random_state=42)

In [26]:
20/80

0.25

In [27]:
len(df_train), len(df_val), len(df_test)

(29337, 9779, 9779)

In [28]:
df_train.head().T

                                          13575  ...         14638
neighbourhood_group                    brooklyn  ...     manhattan
latitude                                40.7276  ...       40.7412
longitude                               -73.945  ...      -74.0001
room_type                       entire_home/apt  ...  private_room
price                                        99  ...           110
minimum_nights                                3  ...             1
number_of_reviews                            29  ...            48
reviews_per_month                           0.7  ...           1.8
calculated_host_listings_count               13  ...             2
availability_365                             50  ...            67

[10 rows x 5 columns]

In [29]:
df_train = df_train.reset_index(drop=True)
df_val = df_val.reset_index(drop=True)
df_test = df_test.reset_index(drop=True)

In [38]:
df_full_train = df_full_train.reset_index(drop=True)
df_full_train[:4]

  neighbourhood_group  ...  availability_365
0            brooklyn  ...                 1
1           manhattan  ...                 0
2            brooklyn  ...                 0
3            brooklyn  ...               267

[4 rows x 10 columns]

In [30]:
df_train.head().T

                                              0  ...             4
neighbourhood_group                    brooklyn  ...     manhattan
latitude                                40.7276  ...       40.7412
longitude                               -73.945  ...      -74.0001
room_type                       entire_home/apt  ...  private_room
price                                        99  ...           110
minimum_nights                                3  ...             1
number_of_reviews                            29  ...            48
reviews_per_month                           0.7  ...           1.8
calculated_host_listings_count               13  ...             2
availability_365                             50  ...            67

[10 rows x 5 columns]

In [31]:
y_train = df_train['price']
y_train.head()

0     99
1     57
2     70
3    130
4    110
Name: price, dtype: int64

In [32]:
y_val = df_val['price']
y_test = df_test['price']

In [33]:
del df_train['price']
del df_val['price']
del df_test['price']

In [34]:
df_train.head().T

                                              0  ...             4
neighbourhood_group                    brooklyn  ...     manhattan
latitude                                40.7276  ...       40.7412
longitude                               -73.945  ...      -74.0001
room_type                       entire_home/apt  ...  private_room
minimum_nights                                3  ...             1
number_of_reviews                            29  ...            48
reviews_per_month                           0.7  ...           1.8
calculated_host_listings_count               13  ...             2
availability_365                             50  ...            67

[9 rows x 5 columns]